In [2]:
# Import Libry
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder, StandardScaler, MinMaxScaler
from sklearn.neighbors import KNeighborsClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.svm import SVC
from sklearn.naive_bayes import GaussianNB
from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, f1_score

In [3]:
#load data
customer = pd.read_csv(r'/workspaces/Belajar-Machine-Learning-Dasar/Machine Learning Prediction Iphone Indonesia/clustering.ipynb/data/customers.csv')
product = pd.read_csv(r'/workspaces/Belajar-Machine-Learning-Dasar/Machine Learning Prediction Iphone Indonesia/clustering.ipynb/data/products.csv')
transaction_deatil = pd.read_csv(r'/workspaces/Belajar-Machine-Learning-Dasar/Machine Learning Prediction Iphone Indonesia/clustering.ipynb/data/transaction_details.csv')
transaction = pd.read_csv(r'/workspaces/Belajar-Machine-Learning-Dasar/Machine Learning Prediction Iphone Indonesia/clustering.ipynb/data/transactions.csv')

In [4]:
# Melihat data secara keseluruhan dari customer
customer.head(1)

,customer_id,name,email,address,phone_number,age,city,preferred_product_id
0,1,Pranata Natsir,marsudimaryati@example.net,"Gang K.H. Wahid Hasyim No. 2\nProbolinggo, Sul...",(049) 526-4376,28,Medan,4

In [5]:
# Melihat data secara keseluruhan dari product
product.head(1)

,product_id,product_name,category,brand,price,description,discount,storage,color,release_year,years_since_release,sales_factor,preferred_product_id
0,1,iPhone 15,Smartphone,Apple,12000000,Accusantium enim inventore optio eum quam atque.,15,128GB,Black,2023,1,0.9,1

In [6]:
# Melihat data secara keseluruhan dari transaction_detail
transaction_deatil.head(1)

   transaction_id  product_id  quantity  unit_price  discount       total
0           25218          12         3     7000000        15  17850000.0

In [7]:
# Melihat data secara keseluruhan dari transaction
transaction.head(1)

,transaction_id,customer_id,transaction_date,total_amount,payment_method,shipping_method,delivery_time,coupon_code,city,product_id,sales_factor
0,1,506,2023-07-22,11300000.0,Cash on Delivery,Tiki,1 minggu,GRATISONGKIR,Jakarta,12,0.7

In [8]:
customer.head(1)

,customer_id,name,email,address,phone_number,age,city,preferred_product_id
0,1,Pranata Natsir,marsudimaryati@example.net,"Gang K.H. Wahid Hasyim No. 2\nProbolinggo, Sul...",(049) 526-4376,28,Medan,4

In [9]:
# Melihat data yang null
print(customer.isnull().sum())

customer_id             0
name                    0
email                   0
address                 0
phone_number            0
age                     0
city                    0
preferred_product_id    0
dtype: int64

In [10]:
product.isnull().sum()

product_id              0
product_name            0
category                0
brand                   0
price                   0
description             0
discount                0
storage                 0
color                   0
release_year            0
years_since_release     0
sales_factor            0
preferred_product_id    0
dtype: int64

In [11]:
transaction_deatil.isnull().sum()

transaction_id    0
product_id        0
quantity          0
unit_price        0
discount          0
total             0
dtype: int64

In [12]:
transaction.isnull().sum()

transaction_id          0
customer_id             0
transaction_date        0
total_amount            0
payment_method          0
shipping_method         0
delivery_time           0
coupon_code         25044
city                    0
product_id              0
sales_factor            0
dtype: int64

In [13]:
# mengisi nilai null dengan nilai yang sesuai yaitu No
transaction['coupon_code'] = transaction['coupon_code'].fillna('No')

In [14]:
# mengecek kembali data yang null dan melihat hasilnya
transaction.isnull().sum()
transaction.head(1)

,transaction_id,customer_id,transaction_date,total_amount,payment_method,shipping_method,delivery_time,coupon_code,city,product_id,sales_factor
0,1,506,2023-07-22,11300000.0,Cash on Delivery,Tiki,1 minggu,GRATISONGKIR,Jakarta,12,0.7
1,2,23275,2024-07-01,11053000.0,DANA,Tiki,2-3 hari,SALE20,Bandung,3,0.9
2,3,24101,2022-11-01,12741000.0,Transfer Bank,JNE,4-5 hari,No,Bandung,5,0.8
3,4,24188,2022-02-04,4921000.0,OVO,JNE,4-5 hari,SALE20,Yogyakarta,10,0.6
4,5,33766,2022-02-06,2163000.0,Transfer Bank,GrabExpress,1 minggu,No,Jakarta,11,0.7
5,6,30177,2023-08-30,3153000.0,Transfer Bank,POS Indonesia,2-3 hari,DISCOUNT10,Jakarta,12,0.7
6,7,48010,2024-07-31,5219000.0,OVO,JNE,4-5 hari,GRATISONGKIR,Jakarta,5,0.8
7,8,30338,2022-01-14,3050000.0,DANA,JNE,4-5 hari,DISCOUNT10,Medan,4,0.9
8,9,41354,2024-08-09,11502000.0,OVO,POS Indonesia,1 minggu,GRATISONGKIR,Jakarta,7,0.8
9,10,16463,2022-09-30,9889000.0,Transfer Bank,Tiki,1 minggu,SALE20,Jakarta,9,0.5

In [15]:
transaction['shipping_method'].unique()

array(['Tiki', 'JNE', 'GrabExpress', 'POS Indonesia', 'GoSend'],
      dtype=object)

In [16]:
# info data set
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 8 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   customer_id           50000 non-null  int64
 1   name                  50000 non-null  object
 2   email                 50000 non-null  object
 3   address               50000 non-null  object
 4   phone_number          50000 non-null  object
 5   age                   50000 non-null  int64
 6   city                  50000 non-null  object
 7   preferred_product_id  50000 non-null  int64
dtypes: int64(3), object(5)
memory usage: 3.1+ MB

In [17]:
customer.head(1)

,customer_id,name,email,address,phone_number,age,city,preferred_product_id
0,1,Pranata Natsir,marsudimaryati@example.net,"Gang K.H. Wahid Hasyim No. 2\nProbolinggo, Sul...",(049) 526-4376,28,Medan,4
1,2,Estiono Irawan,cagak03@example.net,"Gg. KH Amin Jasuta No. 934\nTernate, BB 16278",+62-0135-866-6997,46,Medan,4
2,3,Yessi Yulianti,karimahhabibi@example.org,"Gg. Cihampelas No. 1\nCilegon, Jambi 06207",+62-099-515-6369,58,Makassar,2
3,4,drg. Bakti Kusmawati,ipertiwi@example.com,Jl. M.T Haryono No. 67\nKota Administrasi Jaka...,+62 (898) 893-0434,59,Bandung,9
4,5,Martani Sihombing,alazuardi@example.org,"Jl. Moch. Toha No. 2\nSabang, SB 34581",+62 (045) 241 9670,51,Bandung,3
5,6,Dt. Unggul Wasita,endrahidayanto@example.net,"Jalan M.T Haryono No. 4\nDenpasar, KU 43926",+62 (031) 914 4830,37,Jakarta,4
6,7,Ana Rajata,bagas10@example.org,"Jalan Kapten Muslihat No. 920\nBima, JB 30205",+62 (0962) 266 0894,44,Surabaya,4
7,8,Wira Nasyiah,wijayaniyaga@example.com,"Jl. W.R. Supratman No. 06\nSorong, SU 66656",+62 (080) 671-6191,44,Jakarta,9
8,9,"Darman Damanik, S.Sos",hartana37@example.com,"Jl. H.J Maemunah No. 28\nSurakarta, GO 59437",+62-018-414-0830,47,Jakarta,5
9,10,"Novi Mahendra, S.Kom",faridasuci@example.com,"Jalan Jend. A. Yani No. 64\nBandar Lampung, SU...",+62 (0630) 469 0526,66,Jakarta,11

In [ ]:
# Hapus kolom yang tidak relevan
customer_df = customer.drop(['customer_id', 'name', 'email', 'address', 'phone_number'], axis=1)

# Menampilkan data setelah pembersihan
customer_df.head(5)

   age      city  preferred_product_id
0   28     Medan                     4
1   46     Medan                     4
2   58  Makassar                     2
3   59   Bandung                     9
4   51   Bandung                     3

In [ ]:
# Hapus kolom yang tidak relevan
product_df = product.drop([ 'category', 'description', 'brand', 'years_since_release','preferred_product_id','sales_factor'], axis=1)

,product_id,product_name,price,discount,storage,color,release_year
0,1,iPhone 15,12000000,15,128GB,Black,2023
1,2,iPhone 15 Plus,13000000,15,256GB,Blue,2023
2,3,iPhone 15 Pro,16000000,10,512GB,Silver,2023
3,4,iPhone 15 Pro Max,18000000,5,1TB,Gold,2023
4,5,iPhone 14,11000000,15,128GB,Red,2022
5,6,iPhone 14 Plus,12000000,5,256GB,Green,2022
6,7,iPhone 14 Pro,15000000,5,512GB,Purple,2022
7,8,iPhone 14 Pro Max,17000000,0,128GB,Yellow,2022
8,9,iPhone SE (3rd Gen),7000000,5,64GB,White,2021
9,10,iPhone 13,10000000,15,128GB,Pink,2021
10,11,iPhone 13 Pro,13000000,15,256GB,Silver,2021
11,12,iPhone 13 Pro Max,15000000,5,512GB,Space Gray,2021

In [20]:
# Menghapus kolom 'transaction_id' dari dataset
transaction_df = transaction.drop(columns=['transaction_id'])
transaction_df.head()

,customer_id,transaction_date,total_amount,payment_method,shipping_method,delivery_time,coupon_code,city,product_id,sales_factor
0,506,2023-07-22,11300000.0,Cash on Delivery,Tiki,1 minggu,GRATISONGKIR,Jakarta,12,0.7
1,23275,2024-07-01,11053000.0,DANA,Tiki,2-3 hari,SALE20,Bandung,3,0.9
2,24101,2022-11-01,12741000.0,Transfer Bank,JNE,4-5 hari,No,Bandung,5,0.8
3,24188,2022-02-04,4921000.0,OVO,JNE,4-5 hari,SALE20,Yogyakarta,10,0.6
4,33766,2022-02-06,2163000.0,Transfer Bank,GrabExpress,1 minggu,No,Jakarta,11,0.7

In [22]:
product['color'].unique()

array(['Black', 'Blue', 'Silver', 'Gold', 'Red', 'Green', 'Purple',
       'Yellow', 'White', 'Pink', 'Space Gray'], dtype=object)

In [4]:
# Merge data berdasarkan customer_id, city, dan product_id yang sesuai dengan preferred_product_id
merged_data = pd.merge(transaction, customer, 
                       left_on=['city', 'product_id'], 
                       right_on=['city', 'preferred_product_id'], 
                       how='left')
merged_data.head(10)

: